cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

cask 'xquartz'

brew 'ack'
brew 'imagemagick'
brew 'jp2a'
brew 'coreutils'
brew 'grc'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'legit'
brew 'git-lfs'
brew 'tldr'

cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'bartender'
cask 'colorsnapper'
# cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'franz'
# cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'imageoptim'
cask 'istat-menus'
cask 'istat-menus'
cask 'mamp'
cask 'spotify'
cask 'transmission'
# cask 'visual-studio-code'
cask 'vlc'
cask 'xscope'