cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

cask 'xquartz'

brew 'ack'
brew 'imagemagick'
brew 'jp2a'
brew 'exiftool'
brew 'coreutils'
brew 'grc'
brew 'libcaca'
brew 'imlib2'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spark'
brew 'p7zip'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'legit'
brew 'git-lfs'
brew 'tldr'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'bartender'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'franz'
cask 'github'
cask 'gimp'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'hyper'
cask 'imageoptim'
cask 'istat-menus'
cask 'keybase'
cask 'krisp'
cask 'mamp'
cask 'setapp'
cask 'spotify'
cask 'tunnelblick'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'xscope'