# see https://gist.github.com/nothingrandom/499d3b91e7e3dcd31b556cc86965bf24
# for a full dump from `brew list`

cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

cask 'xquartz'

brew 'ack'
brew 'imagemagick'
brew 'jp2a'
brew 'exiftool'
brew 'coreutils'
brew 'grc'
brew 'libcaca'
brew 'imlib2'
brew 'libgit2'
brew 'mas'
brew 'openssl'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spark'
brew 'p7zip'
brew 'wget'
brew 'yt-dlp'
brew 'legit'
brew 'git-lfs'
brew 'tldr'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'adobe-creative-cloud'
cask 'betterdisplay'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'hyper'
cask 'imageoptim'
cask 'istat-menus'
cask 'jordanbaird-ice'
cask 'keybase'
cask 'logi-options-plus'
cask 'microsoft-teams'
cask 'raycast'
cask 'tunnelblick'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
